import os

# Токен бота
TOKEN = os.getenv("BOT_TOKEN")

# База данных
DATABASE = "league.db"

# Файлы
PLAYERS_CSV = "players.csv"
CLUBS_CSV = "clubs.csv"

# Клубы Серии А
CLUBS = [
    "Интер",
    "Милан",
    "Ювентус",
    "Наполи",
    "Рома",
    "Лацио",
    "Фиорентина",
    "Болонья",
    "Торино",
    "Аталанта",
]

# Бюджеты клубов
BUDGETS = {
    "Интер": 120_000_000,
    "Милан": 100_000_000,
    "Ювентус": 150_000_000,
    "Наполи": 90_000_000,
    "Рома": 80_000_000,
    "Лацио": 75_000_000,
    "Фиорентина": 70_000_000,
    "Болонья": 65_000_000,
    "Торино": 60_000_000,
    "Аталанта": 95_000_000,
}
